RepXcel/nRF52832-Embedded-Application/src/main.c
static void accel_off(void){
    ret_code_t err_code;
    LIS2DH12_DATA_CFG(m_lis2dh12, LIS2DH12_ODR_POWERDOWN, false, true, true, true, LIS2DH12_SCALE_2G, true);
    err_code = lis2dh12_cfg_commit(&m_lis2dh12);
    
    APP_ERROR_CHECK(err_code);
}

static void update_velocity(void){
    uint8_t samples_to_read = 0;
    for (uint8_t i = 0; i < ACCEl_BUFFER_SIZE; i++){
        int16_t accel_x_mg = m_accel_data[i].x >> 4;
        int16_t accel_y_mg = m_accel_data[i].y >> 4;
        int16_t accel_z_mg = m_accel_data[i].z >> 4;
        float accel_magnitude_mg = sqrt(accel_x_mg * accel_x_mg + accel_y_mg * accel_y_mg + accel_z_mg * accel_z_mg);
        float accel_magnitude_cmpss = MG_TO_CMPS(accel_magnitude_mg);
        if (accel_magnitude_cmpss > ACCEL_ERROR_THRESHOLD) {
            samples_to_read = ACCEL_SAMPLE_TOLERANCE;
        }
        if(samples_to_read){
            m_velocity += accel_magnitude_cmpss * ACCEL_PERIOD;
        } else {
            m_velocity = 0;
            samples_to_read = MAX(samples_to_read - 1, 0);
        }
        UNUSED_RETURN_VALUE(vTaskResume(m_rep_velocity_thread));
        NRF_LOG_INFO("Velocity: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(m_velocity));
        NRF_LOG_INFO("Rep state %d, Rep Velocity: " NRF_LOG_FLOAT_MARKER, m_device_state, NRF_LOG_FLOAT(m_rep_velocity.data));
    }
}

static void accel_thread(void * arg)
{
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;
    for(;;)
    {
        __WFI();
        if(m_data_ready) {
            err_code = lis2dh12_data_read(&m_lis2dh12, NULL, m_accel_data, ACCEl_BUFFER_SIZE);
            APP_ERROR_CHECK(err_code);
            update_velocity();
            bsp_board_led_off(BSP_BOARD_LED_1);
            m_data_ready = false;
        }
    }
}

static void rep_velocity_thread(void  * arg){
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;
    uint32_t sample_count = 0;
    float temp_rep_velocity = 0;
    for(;;)
    {
        switch(m_device_state){
            case REST:
            if(m_velocity > REP_VELOCITY_MINIMUM){
                temp_rep_velocity = 0;
                sample_count = 0;
                temp_rep_velocity = m_velocity;
                m_device_state = BEGIN_MOVING;
            }
            break;

            case BEGIN_MOVING:
            if(m_velocity == 0){
                m_device_state = REST;
            } else if(sample_count == REP_VELOICTY_MOVING_THRESHOLD){
                m_device_state = MOVING;
            }
            temp_rep_velocity = MAX(temp_rep_velocity, m_velocity);
            sample_count++;
            break;

            case MOVING:
            if(m_velocity == 0){
                m_rep_velocity.data = temp_rep_velocity;
                m_device_state = REST;
            }
            temp_rep_velocity = MAX(temp_rep_velocity, m_velocity); 
            break;

            default:
            break;
        }
        vTaskSuspend(NULL);
    }
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    bool delete_bonds = false;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(&delete_bonds);
            break;

        default:
            break;
    }
}

/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the Battery measurement timer time-out.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] xTimer Handler to the timer that called this function.
 *                   You may get identifier given to the function xTimerCreate using pvTimerGetTimerID.
 */
static void battery_level_meas_timeout_handler(TimerHandle_t xTimer)
{
    UNUSED_PARAMETER(xTimer);
    battery_level_update();
}


static void notification_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    ret_code_t err_code;
    err_code = ble_workout_data_custom_value_update(&m_workout_data, m_rep_velocity);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    m_ble_notif_timer = xTimerCreate("WKT", NOTIFICATION_INTERVAL, pdTRUE, NULL, notification_timeout_handler);
    m_battery_timer = xTimerCreate("BATT",
                                   BATTERY_LEVEL_MEAS_INTERVAL,
                                   pdTRUE,
                                   NULL,
                                   battery_level_meas_timeout_handler);

